// демонстрація механізму ідентифікації типу під час виконання (RTTI) у c++
// використовується віртуальна функція для забезпечення RTTI

#include <iostream>
using namespace std;
class B 
{
    virtual void fun() {}
};

class D : public B 
{
};

int main()
{
    B* b = new D; // створення об'єкта похідного класу через вказівник на базовий клас

    // намагаємося виконати перетворення вказівника типу B* до типу D* за допомогою dynamic_cast
    D* d = dynamic_cast<D*>(b);

    // перевіряємо чи вдалося перетворення
    if (d != nullptr)
        cout << "перетворення успішне";
    else
        cout << "не вдалося перетворити B* в D*";

    return 0;
}
